//На вход подается 2 переменные. Необходимо написать программу, которая выполняет обмен значений этих переменных. Нельзя использовать никакие дополнительные переменные.

using System;
class Task1
{
	static void Main()
	{
		int a, b;
		a = Convert.ToInt32(Console.ReadLine());
		b = Convert.ToInt32(Console.ReadLine());
		b = a + b;
		a = b - a;
		b = b - a;
		Console.WriteLine(a);
		Console.WriteLine(b);
	}
}
